{
  "header": {
    "name" : "Terante, Aldren R.",
    "position": "Frontend Developer"
  },
  "careerObjective": {
    "content": "Constantly learning and adopting new things to improve my current knowledge and workflow of building things for web application effectively. Proactively shows interests and try to build/implement in my current development workflow. Willingness to learn other languages to update my current toolset are definitely welcome."
  },
  "development": [
    {
      "title": "Frontend",
      "description": "I considered myself dealing more with designs, colors and converting it to a great user experience.",
      "summaries": [
        "A clean, flat and minimal design approach for user interfaces.",
        "Creating user stories. wireframes, mockups and prototyping.",
        "Task automation and automation for smooth frontend workflow."
        "Cross browser and unit testing.",
        "ES6, modular javscript and object oriented implementation.",
        "Deploy script and build automation."
      ]
    },
    {
      "title": "Backend",
      "description": "Working with backend services, bulk JSON dataset, different RESTful APIs and more.",
      "summaries": [
        "Understand the concepts of SOLID and OOP principles.",
        "Knowledgable working with RESTful APIs and JSON.",
        "Understand concepts of BDD and TDD.",
      ]
    }
  ],
  "employment": [
    {
      "companyName": "Salarium",
      "position": "Frontend Developer & UI/UX Designer",
      "date": "September 2014 - Present",
      "experiences": [
        "Involved in research and design for new tech stack to be use for new and current internal apps.",
        "Reimplement most use pages by replacing old legacy code to newly redesign UI/UX.",
        "Involved in development of internal dashboard for managing SalPay users.",
        "Add deploy script for frontend build automation for effecient deployments.",
        "Implement new style kit to be use with the new modular frontend/backend templating.",
        "Setup the new templating to be use for both frontend/backend.",
        "Involved in planning and design the UI/UX of the current Salarium \"Sal Clock In\" Andriod App",
        "Created pdf template service for generating payslip in pdf format",
        "Mostly involved in planning and designing for new features to be implemented."
      ],
      "tags": [
        "react",
        "redux",
        "webpack",
        "mocha",
        "chai",
        "sinon",
        "rscss",
        "rsjs",
        "balsamiq",
        "photoshop",
        "twitter bootstrap",
        "jQuery",
        "less",
        "require.js",
        "gulp",
        "grunt",
        "bower",
        "mustache.js",
        "handlesbar.js",
        "sublime",
        "nginx",
        "vagrant",
        "laravel",
        "php",
        "composer",
        "mysql",
        "linux",
        "vim",
        "git",
        "gitlab",
        "bash",
      ]
    },
    {
      "companyName": "Integreon PH",
      "position": "Frontend Developer",
      "date": "June 2013 - September 2014",
      "experiences": [
        "Converts PSD designs for mobile/responsive ready using frontend boilerplate kits.",
        "Conducts deep cross browser testing and site optimization.",
        "Create data visualization usign different kinds of chart libraries.",
        "Prepares documentation for different projects can be work/tranfer smoothly.",
        "Conducts interview for new applicants for the same position.",
      ],
      "tags": [
        "photoshop",
        "wordpress templating",
        "data visualization",
        "site optimization",
        "twitter bootstrap",
        "less",
        "grunt",
        "anycharts.js",
        "chart.js",
        "plot.js"
      ]
    },
    {
      "companyName": "FilSupport",
      "position": "Web Developer/Designer",
      "date": "February 2012 - March 2013",
      "experiences": [
        "Build website information flow/structure for new and existing websites based on the client ideas and convert it to a fresh and unique prototype.",
        "create layouts and wireframes for new and existing websites in Photoshop.",
        "Convert PSD to HTML/CSS with js/jQuery for user interaction with cross browser compatibility and SEO standard.",
        "Knowledgeable in responsive/mobile ready using frontend frameworks/css like twitter bootstrap with less and zurb foundation using sass/compass.",
        "Convert html/css template to wordpress themes.",
      ],
      "tags": [
        "photoshop",
        "wordpress templating",
        "twitter bootstrap",
        "zurb foundation",
        "compass",
        "less",
        "scss",
      ],
    },
    {
      "companyName": "Shinkozan",
      "position": "IT Support & Web Developer",
      "date": "April 2011 - February 2012",
      "tags": [
        "photoshop",
        "wordpress",
        "networking",
        "server management",
      ],
      "experiences": [
        "Responsible for diagnosing and resolving hardware, software and end user problems.",
        "Deploys hardware, server backups, evaluating new software and security risk.",
        "Redesigned and developed existing website using Wordpress.",
        "Maintains all software and company websites.",
      ]
    }
  ]
}