{
  "header": {
    "name" : "Terante, Aldren R.",
    "position": "Frontend Developer"
  },
  "careerObjective": {
    "content": "Actively studying and adopting things that can help to maximize and widen my current knowledge in building applications. Integrating tried and tested tools for improving my current workflow to be more efficient. Creating open source projects for helping/giving back to the community as well."
  },
  "development": [
    {
      "title": "Frontend",
      "description": "I find myself dealing more with the users aesthetic needs ranging from designing user interface/experience to building effective web applications. Right now, I'm love building frontend components with React <3.",
      "summaries": [
        "Building frontend and single page apps with the help of React + Redux.",
        "Adding unit tests while implementing test driven development (TDD).",
        "Adding task automation and test integration for smooth frontend workflow",
        "Creating scripts for deploying and building automation for different environment.",
        "A clean, flat and minimal design approach for user interfaces.",
        "Creating user stories, wireframes, mockups and prototyping."
      ]
    },
    {
      "title": "Backend",
      "description": "Have a good knowledge in working with different RESTful APIs, knows how to build small to intermediate backend services written in PHP using Laravel/Lumen framework and more.",
      "summaries": [
        "Have a good understanding of the concepts of SOLID, DRY and OOP principles.",
        "Understand the concepts and have fairly experience of implementing unit testing, TDD and BDD for backend.",
        "Actively shows interests in design patterns and software architecture by creating pet projects."
      ]
    }
  ],
  "employment": [
    {
      "companyName": "Salarium",
      "position": "Frontend Developer & UI/UX Designer",
      "date": "September 2014 - Present",
      "experiences": [
        "Currently collaborating with the team in converting the legacy app to a separate Frontend (SPA) using React + Redux.",
        "Help on creating small and unit tested components build in React required for building Salarium User Interface Kit V3.",
        "Closing working with the product team for helping/building specs for UI/UX.",
        "Help in creating a SPA dashboard build in React + Redux and consuming internal API for specific clients.",
        "Created a dashboard build in Laravel/ES6 (also use internal API) for managing/monitoring SalPay users for support.",
        "Adding new features for in legacy apps and using RequireJS for clean modular approach.",
        "Involved in research and design for implementing new tech stack to be use for new and current internal apps.",
        "Add deployment script and build automation for the Front End using GruntJS for different environments.",
        "Created PDF template service written in PHP for generating payslip in PDF format.",
        "Re-implement most use pages by replacing old legacy code to newly redesign UI/UX.",
        "Setup the new templating to be use for both Frontend/Backend.",
        "Involved in planning and design the UI/UX of the current Salarium \"Sal Clock In\" andriod app."
      ],
      "tags": [
        "react",
        "redux",
        "webpack",
        "mocha",
        "chai",
        "sinon",
        "rscss",
        "rsjs",
        "balsamiq",
        "photoshop",
        "twitter bootstrap",
        "jQuery",
        "less",
        "require.js",
        "gulp",
        "grunt",
        "bower",
        "mustache.js",
        "handlesbar.js",
        "sublime",
        "nginx",
        "vagrant",
        "laravel",
        "php",
        "composer",
        "mysql",
        "linux",
        "vim",
        "git",
        "gitlab",
        "bash"
      ]
    },
    {
      "companyName": "Integreon PH",
      "position": "Frontend Developer",
      "date": "June 2013 - September 2014",
      "experiences": [
        "Converts PSD designs for mobile/responsive ready using frontend boilerplate kits.",
        "Conducts deep cross browser testing and site optimization.",
        "Create data visualization usign different kinds of chart libraries.",
        "Prepares documentation for different projects can be work/tranfer smoothly.",
        "Conducts interview for new applicants for the same position."
      ],
      "tags": [
        "photoshop",
        "wordpress templating",
        "data visualization",
        "site optimization",
        "twitter bootstrap",
        "less",
        "grunt",
        "anycharts.js",
        "chart.js",
        "plot.js"
      ]
    },
    {
      "companyName": "FilSupport",
      "position": "Web Developer/Designer",
      "date": "February 2012 - March 2013",
      "experiences": [
        "Build website information flow/structure for new and existing websites based on the client ideas and convert it to a fresh and unique prototype.",
        "create layouts and wireframes for new and existing websites in Photoshop.",
        "Convert PSD to HTML/CSS with js/jQuery for user interaction with cross browser compatibility and SEO standard.",
        "Knowledgeable in responsive/mobile ready using frontend frameworks/css like twitter bootstrap with less and zurb foundation using sass/compass.",
        "Convert html/css template to wordpress themes."
      ],
      "tags": [
        "photoshop",
        "wordpress templating",
        "twitter bootstrap",
        "zurb foundation",
        "compass",
        "less",
        "scss"
      ]
    },
    {
      "companyName": "Shinkozan",
      "position": "IT Support & Web Developer",
      "date": "April 2011 - February 2012",
      "tags": [
        "photoshop",
        "wordpress",
        "networking",
        "server management"
      ],
      "experiences": [
        "Responsible for diagnosing and resolving hardware, software and end user problems.",
        "Deploys hardware, server backups, evaluating new software and security risk.",
        "Redesigned and developed existing website using Wordpress.",
        "Maintains all software and company websites."
      ]
    }
  ],
  "education": [
    {
      "course": "Bachelor of Science major in Computer Science",
      "school": "University of Perpetual Help System GMA Cavite",
      "date": "2007 - 2011"
    },
    {
      "course": "Civil Engeering Technology",
      "school": "Technological University of the Philippines, Cavite Campus",
      "date": "2006 - 2007"
    }
  ],
  "contact": [
    {
      "type": "GitHub",
      "link": "https://github.com/thecodingwhale",
      "blank": true
    },
    {
      "type": "Linkedin",
      "link": "https://ph.linkedin.com/in/aldren-terante-82685670",
      "blank": true
    },
    {
      "type": "Email",
      "link": "mailto:aldren.terante@gmail.com"
    }
  ]
}